app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "ykcir.deep@gmail.com"], ["password", "Deepak007"], ["created_at", "2016-04-25 11:01:03.025842"], ["updated_at", "2016-04-25 11:01:03.025842"]]